{
    "version": "https://jsonfeed.org/version/1",
    "title": "ABQM.NET",
    "description": "",
    "home_page_url": "https://www.abqm.net",
    "feed_url": "https://www.abqm.net/feed.json",
    "user_comment": "",
    "author": {
        "name": "Aaron Estrada"
    },
    "items": [
        {
            "id": "https://www.abqm.net/about.html",
            "url": "https://www.abqm.net/about.html",
            "title": "About the Mesh",
            "summary": "How does it work? Several people have set up a number of microcomputer controlled radio repeaters in Albuquerque. These radios communicate on the 906.875 MHZ frequency using the LoRa protocol. The radios mesh using the open-source Meshtastic software. Users can connect to these repeaters by Bluetooth if they’re close&hellip;",
            "content_html": "<h2>How does it work?</h2>\n<p>Several people have set up a number of microcomputer controlled radio repeaters in Albuquerque. These radios communicate on the <a href=\"https://en.wikipedia.org/wiki/33-centimeter_band\">906.875 MHZ</a> frequency using the <a href=\"https://en.wikipedia.org/wiki/LoRa\">LoRa protocol</a>. The radios mesh using the open-source <a href=\"https://meshtastic.org/\">Meshtastic</a> software. Users can connect to these repeaters by Bluetooth if they’re close enough or they can use their own handheld Meshtastic nodes which will also act as repeaters. The messages hop from node to node, extending the reach of the network and ensuring everyone receives every message.</p>\n<hr>\n<h2>What can it do?</h2>\n<h2 style=\"margin-top: 0px; font-family: var(--font-base); font-weight: var(--font-weight-bold); letter-spacing: var(--letter-spacing); font-size: 1.60181em;\"><figure class=\"post__image post__image--right\"><img loading=\"lazy\"  style=\"margin-bottom: 1.37143rem; margin-left: 1.37143rem; color: var(--text-primary-color); font-family: var(--editor-font-family); font-size: inherit; font-weight: var(--font-weight-normal); outline: 3px solid rgba(var(--color-primary-rgb), 0.55) !important;\" src=\"https://www.abqm.net/media/posts/2/cartoon_roadrunner2.svg\" alt=\"\" width=\"187\" height=\"163\"></figure></h2>\n<p>Meshtastic is a bit like a decentralized social media platform or SMS text messaging. It has a number of different features which will be familiar to anyone who has sent a text message or posted on social media.</p>\n<dl>\n<dt>\n<h6>1) Primary Channel:</h6>\n</dt>\n<dd>You can broadcast an unencrypted message to the Primary Channel and everyone on your mesh will see it. This is a bit like “posting” publicly on a social media platform.</dd>\n<dt>\n<h6>2) Group Channels:</h6>\n</dt>\n<dd>You can send an encrypted message to a select group of people on a Secondary Channel and everyone who is subscribed to that channel will get it. People can join the channel if you provide them with an encryption key which you can send to them via Direct Message or which they can scan from a QR code in person. This is a bit like a private group on social media, or a group text message chain on SMS.</dd>\n<dt>\n<h6>3) Direct Messages:</h6>\n</dt>\n<dd>You can send encrypted direct messages to people on the mesh. This is like a private text message or a DM on social medial.</dd>\n<dt>\n<h6>4) Location:</h6>\n</dt>\n<dd>If you choose to enable it you can send your location to the mesh and it will show up on everyone’s map in the app.</dd>\n<dt>\n<h6>5) Connect Worldwide:</h6>\n</dt>\n<dd>If anyone on your local mesh is running an MQTT gateway your local mesh will connect to the other meshes around the world. This can allow you to broadcast messages to everyone globally or send encrypted messages to groups or individuals worldwide.</dd>\n<dt>\n<h6>6) Telemetry Data:</h6>\n</dt>\n<dd>Nodes can be set up to send telemetry data like the battery status or signal strength, which is helpful for monitoring remote solar-powered nodes. Nodes can also have sensors connected to them which allow them to send data on temperature, humidity, or air pressure which allow them to act like weather stations.</dd>\n</dl>\n<hr>\n<h2 id=\"why-build-network\">Why build this network?</h2>\n<p> </p>\n<h6>1) Community</h6>\n<p>Because this is essentially a city-wide group text message chain we are hoping people use the network to build community. Tell the group where your band is playing tonight, chat about local politics, ask for a good cheese dip recipe, etc.</p>\n<h6>2) Disasters</h6>\n<p>If the power goes out this network should allow people to continue to communicate with each other without cell phone coverage or the internet. This big city-wide group text chain could allow people to ask for help or offer assistance. People could get information about where help is available. People could also send encrypted direct messages to check in on friends and family or they could send encrypted group messages to coordinate privately in a group.</p>\n<h6>3) Decentralized, Open, and Resilient</h6>\n<p>Albuquerque Mesh is decentralized - there is no central server or corporation - all the communication bounces through the entire mesh. Albuquerque Mesh is open to everyone - you don't have to ask permission to join and all of the software is open-source. Albuquerque Mesh is resilient - solar-powered radios don't need cell phone towers, internet access, or electricity from the grid. We hope this project will inspire others to build things that are decentralized, open, and resilient.</p>\n<hr>\n<h2 id=\"join-the-network\">How can I join the network?</h2>\n<ol>\n<li>Get a Meshtastic Radio.<br>You can build one yourself for about $35. The official Meshtastic page keeps a current list of <a href=\"https://meshtastic.org/docs/hardware/devices/\">Supported Hardware.</a> The LILYGO T-Echo is a good first Meshtastic radio, as it costs around $70 and is ready to go out of the box (besides having to flash the firmware).<br>You can also buy a pre-built battery-powered radio for between $50-$100 on Etsy or eBay - these usually have 3D printed cases.<br>If you can afford it, and have a place to mount it outside, consider buying a pre-built solar-powered node for between $100 and $200 on Etsy and mount it as high off the ground as you can. Alternatively you can build your own. (The team at <a href=\"https://austinmesh.org/#building-a-solar-powered-repeater\" target=\"_blank\" rel=\"noopener noreferrer\">Austin Mesh</a> has a lot of experience with this so far earned via several generation of deployments. We hope to add our experience to the pool of collective knowledge as we learn more about deploying nodes in our climate here in Albuquerque.)</li>\n<li>Download the <a href=\"https://meshtastic.org/docs/software\">Meshtastic App</a> on your iPhone or Android.</li>\n<li>Pair your radio to your phone with Bluetooth.</li>\n<li>Open the Meshtastic app and say hi on the default open channel \"LongFast\"!</li>\n</ol>",
            "author": {
                "name": "Aaron Estrada"
            },
            "tags": [
                   "Blog"
            ],
            "date_published": "2024-03-23T18:30:00-06:00",
            "date_modified": "2024-03-24T04:06:02-06:00"
        },
        {
            "id": "https://www.abqm.net/welcome.html",
            "url": "https://www.abqm.net/welcome.html",
            "title": "Albuquerque Mesh",
            "summary": "Albuquerque Mesh Network is a loose knit community of people building a mesh network using Meshtastic radios in Albuquerque, New Mexico. This network acts like a city-wide text messaging system, allowing people to communicate publicly or privately with anyone on the network. We are just&hellip;",
            "content_html": "<figure class=\"post__image post__image--right\"><img loading=\"lazy\"  src=\"https://www.abqm.net/media/posts/1/cartoon_roadrunner.svg\" alt=\"\" width=\"247\" height=\"128\"></figure>Albuquerque Mesh Network is a loose knit community of people building a mesh network using <a href=\"https://meshtastic.org/\">Meshtastic</a> radios in Albuquerque, New Mexico. This network acts like a city-wide text messaging system, allowing people to communicate publicly or privately with anyone on the network.</p>\n<p>We are just getting started and a lot of details are still being figured out. Stay tuned to this site for more info as things come into better focus.</p>\n<!-- Begin Mailchimp Signup Form -->\n<h5>In the meantime, consider joining us on the ABQMesh <a href=\"https://discord.gg/mz6qkfy\" target=\"_blank\" rel=\"noopener noreferrer\">Discord</a><a href=\"https://discord.com/channels/467266470188154881/467266471022690305\"></a></h5>\n<h5>or email us at <a href=\"mailto:info@abqm.net\" target=\"_blank\" rel=\"noopener noreferrer\">info@abqm.net</a></h5>\n<h5> </h5>\n<h5>Interested in how it all works? Check out this post: <a href=\"https://www.abqm.net/about.html\">About the Mesh</a></h5>\n<!--End mc_embed_signup-->",
            "author": {
                "name": "Aaron Estrada"
            },
            "tags": [
                   "Blog"
            ],
            "date_published": "2024-03-23T18:00:00-06:00",
            "date_modified": "2024-03-24T04:55:58-06:00"
        }
    ]
}
